Practicas/PracticasGretl/Lecc12.org
#+title:  Lección 12
#+author: Marcos Bujosa
#+STARTUP: show4levels
#+LANGUAGE: es-es

#+EXPORT_FILE_NAME: pub/Lecc12

# +OPTIONS: toc:nil
#+OPTIONS: tags:nil

#+LATEX_CLASS: article

#+LATEX_HEADER: \usepackage[spanish]{babel}
#+LATEX_HEADER: \usepackage[margin=0.5in]{geometry}
#+LaTeX_HEADER: \usepackage[svgnames,x11names]{xcolor}
#+LaTeX_HEADER: \hypersetup{linktoc = all, colorlinks = true, urlcolor = DodgerBlue4, citecolor = PaleGreen1, linkcolor = SpringGreen4}
#+LaTeX_HEADER: \PassOptionsToPackage{hyphens}{url}
#+LaTeX_HEADER: \usepackage{nacal}

#+bibliography: ref.bib

#+LaTeX_HEADER: \usepackage{framed}

#+LaTeX_HEADER: \usepackage{listings}
#+LaTeX_HEADER: \input{hansl.tex}
#+LaTeX_HEADER: \lstnewenvironment{hansl-gretl}
#+LaTeX_HEADER: {\lstset{language={hansl},basicstyle={\ttfamily\footnotesize},numbers,rame=single,breaklines=true}}
#+LaTeX_HEADER: {}
#+LaTeX_HEADER: \newcommand{\hansl}[1]{\lstset{language={hansl},basicstyle={\ttfamily\small}}\lstinline{#1}}
# +LaTeX_HEADER: \lstset{backgroundcolor=\color{white},basicstyle=\ttfamily\footnotesize,breaklines=true, captionpos=b,commentstyle=\color{mygreen},escapeinside={\%*}{*)}, keywordstyle=\color{blue},stringstyle=\color{mymauve}, }
# +LaTeX_HEADER: \lstset{backgroundcolor=\color{lightgray!20},basicstyle=\ttfamily\footnotesize,breaklines=true, }
#+LaTeX_HEADER: \lstset{backgroundcolor=\color{lightgray!20}, }

#+name: setup-listings
#+begin_src emacs-lisp :exports none :results silent
  (setq org-latex-listings 'listings)
  (setq org-latex-custom-lang-environments
  	;'((emacs-lisp "common-lispcode")))
  	'((emacs-lisp "hansl-gretl")))
  (setq org-latex-listings-options
	'(("frame" "lines")
	  ("basicstyle" "\\scriptsize")
	  ("basicstyle" "\\ttfamily")
	  ("numbers=none" "left")
	  ("backgroundcolor=\\color{lightgray!20}")
	  ("numberstyle" "\\tiny")))
  (setq org-latex-to-pdf-process
	'("pdflatex -interaction nonstopmode -output-directory %o %f"
	"pdflatex -interaction nonstopmode -output-directory %o %f"
	"pdflatex -interaction nonstopmode -output-directory %o %f"))
  (org-add-link-type
   "latex" nil
   (lambda (path desc format)
     (cond
      ((eq format 'html)
       (format "<span class=\"%s\">%s</span>" path desc))
      ((eq format 'latex)
       (format "\\%s{%s}" path desc)))))
#+end_src


# \lstnewenvironment{code}
#     {\lstset{language=haskell,
#     basicstyle=\small\ttfamily,
#     numbers=left,
#     numberstyle=\tiny\color{gray},
#     backgroundcolor=\color{lightgray},
#     firstnumber=auto
#     }}
#     {}

#+bibliography: ref.bib

# +latex: \clearpage

#+LATEX: \clearpage

#+macro: lugar [[https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/$1][$1]]

#+macro: codigo \lstinputlisting{scripts/$1} 

* Precio de casas unifamiliares (tasación de inmobiliarias y características de las viviendas)
   :PROPERTIES:
   :header-args: :tangle ./pub/scripts/Houses3.inp
   :END:
   
| Guión: | {{{lugar(Houses3.inp)}}} |

**** Objetivo
- Identificar un problema de multicolinealidad de grado.
- Estudiar alternativas para evitar dicho problema.
  
**** Para empezar
Para realizar la práctica, primero cargue los datos de la base de
datos de Gretl:

*/~Archivo --> Abrir datos --> Archivo de muestra~/* y en la pestaña
*/~Wooldrige~/* seleccione =hprice1=.

#+latex: {\vspace{0pt} \color{gray!70!black}
/o bien teclee en linea de comandos/:
  #+begin_src hansl
open hprice1
  #+end_src  
#+latex: }

**** Los datos

Ésta es una aplicación con datos reales de casas unifamiliares en EEUU:
- \textsf{price}  = precio de venta (en miles de $).
- \textsf{assess} = tasación de la inmobiliaria (en miles de $).
- \textsf{bdrms}  = número de dormitorios.
- \textsf{lotsize} = tamaño de la parcela en pies al cuadrado.
- \textsf{sqrft}  = tamaño de la vivienda en pies al cuadrado.
- \textsf{colonial} = 1 si es de estilo colonial. 0 en el resto de casos.
  
**** El modelo inicial
Inicialmente intentaremos emplear todas las variables disponibles para
explicar los precios:
\begin{displaymath}
  \scriptstyle
  \Vect{\VA{price}}\ = \ \beta_1\VAindUno 
  \ +\ \beta_2\Vect{\VA{assess}}
  \ +\ \beta_3\Vect{\VA{bdrms}}
  \ +\ \beta_4\Vect{\VA{lotsize}}
  \ +\ \beta_5\Vect{\VA{sqrft}}
  \ +\ \beta_6\Vect{\VA{colonial}}
  \ +\ \Vect{\per}
\end{displaymath}

** Actividad 1
Piense si alguna de las variables disponibles debería salir del
modelo, por no ser relevante en la determinación del precio de la
vivienda.
** Actividad 2
Piense cuáles son los signos esperados de los parámetros del modelo.

** Actividad 3
Ajuste por MCO el modelo:
\begin{displaymath}
  \scriptstyle
  \Vect{price}\ = \
       \Estmc{\beta_1}\Vect{1}
  \ +\ \Estmc{\beta_2}\Vect{assess}
  \ +\ \Estmc{\beta_3}\Vect{bdrms}
  \ +\ \Estmc{\beta_4}\Vect{lotsize}
  \ +\ \Estmc{\beta_5}\Vect{sqrft}
  \ +\ \Estmc{\beta_6}\Vect{colonial}
  \ +\ \res
\end{displaymath}

#+latex: {\vspace{0pt} \color{gray!70!black}
  #+begin_src hansl
Modelo1     <- ols price 0 assess bdrms lotsize sqrft colonial
  #+end_src  
#+latex: }

- ¿Qué variables son significativas en este modelo?  ¿Coincide esto con su previsión?
- A la luz de esta primera regresión. ¿Las inmobiliarias infravaloran o sobrevaloran los inmuebles?

** Actividad 4
¡Sorprendentemente parece que las características del inmueble no son
significativas para explicar el precio!

¿Es conjuntamente significativo este modelo para ``explicar'' los
precios? Observe el estadístico F.

** Actividad 5
Si hay una estrecha relación lineal entre regresores, es difícil
discriminar el papel particular de cada uno. Esta incertidumbre se
refleja en la varianza de los estimadores.

Consecuentemente algunas variables, en teoría importantes, pueden
resultar estadísticamente no significativas.

Las inmobiliarias emplean las características del inmueble para
arrojar una tasación. Así, es muy probable una estrecha relación entre
las características y la tasación.

- Observe los diagramas de dispersión de las variables de cada
casa con su tasación

*/~Ver --> Gráficos múltiples~/* y elija =assess= como variable del
eje =y=, y el resto como variables del eje =X=.
#+latex: {\vspace{0pt} \color{gray!70!black}
/o bien teclee en linea de comandos/:
  #+begin_src hansl
Diagramas   <- scatters bdrms lotsize sqrft colonial ; assess --output="display"
  #+end_src  
#+latex: }

** Actividad 6
Analice la correlación entre =assess= y el resto de regresores.
#+latex: {\vspace{0pt} \color{gray!70!black}
  #+begin_src hansl
corr assess bdrms lotsize sqrft colonial
  #+end_src  
#+latex: }

** Actividad 7

- La colinealidad se debe a que la muestra no contiene información
  suficiente para estimar con una precisión satisfactoria todos los
  parámetros.
  
- Las soluciones directas a este problema consisten en
  
  + añadir información (en este caso no podemos)
  + simplificar el modelo
  + También es posible eliminar información redundante mediante
    regresiones auxiliares 

Mejor que analizar relaciones lineales entre pares (correlaciones) es
estudiar si las características de la casa explican en un modelo
lineal la valoración de las inmobiliarias. 
- Ajuste por MCO el siguiente modelo
  \begin{displaymath}
    \Vect{assess}\ = \
         \Estmc{\beta_1}\Vect{1} 
    \ +\ \Estmc{\beta_2}\Vect{bdrms}
    \ +\ \Estmc{\beta_3}\Vect{lotsize}
    \ +\ \Estmc{\beta_4}\Vect{sqrft}
    \ +\ \Estmc{\beta_5}\Vect{colonial}
    \ +\ \res
  \end{displaymath}

#+latex: {\vspace{0pt} \color{gray!70!black}
  #+begin_src hansl
ModeloAux   <- ols assess 0 bdrms lotsize sqrft colonial
  #+end_src  
#+latex: }
  
- Observe el coeficiente de determinación para comprobar hasta que
  punto las características de las vivienda en su conjunto
  ``explican'' la tasación de la inmobiliaria.
  
- ¿Qué variables son más significativas para explicar la tasación?

