Practicas/PracticasGretl/pub/Lecc12.tex
% Created 2023-11-27 lun 11:56
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[spanish, ]{babel}
\usepackage[margin=0.5in]{geometry}
\usepackage[svgnames,x11names]{xcolor}
\hypersetup{linktoc = all, colorlinks = true, urlcolor = DodgerBlue4, citecolor = PaleGreen1, linkcolor = SpringGreen4}
\PassOptionsToPackage{hyphens}{url}
\usepackage{nacal}
\usepackage{framed}
\usepackage{listings}
\input{hansl.tex}
\lstnewenvironment{hansl-gretl}
{\lstset{language={hansl},basicstyle={\ttfamily\footnotesize},numbers,rame=single,breaklines=true}}
{}
\newcommand{\hansl}[1]{\lstset{language={hansl},basicstyle={\ttfamily\small}}\lstinline{#1}}
\lstset{backgroundcolor=\color{lightgray!20}, }
\author{Marcos Bujosa}
\date{\today}
\title{Lección 12}
\begin{document}

\maketitle
\tableofcontents

\clearpage

\section{Precio de casas unifamiliares (tasación de inmobiliarias y características de las viviendas)}
\label{sec:orgba3e995}
\begin{center}
\begin{tabular}{ll}
Guión: & \href{https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/Houses3.inp}{Houses3.inp}\\
\end{tabular}
\end{center}

\begin{enumerate}
\item Objetivo
\label{sec:org8745994}
\begin{itemize}
\item Identificar un problema de multicolinealidad de grado.
\item Estudiar alternativas para evitar dicho problema.
\end{itemize}

\item Para empezar
\label{sec:orgf0199f2}
Para realizar la práctica, primero cargue los datos de la base de
datos de Gretl:

\textbf{\emph{\texttt{Archivo -{}-> Abrir datos -{}-> Archivo de muestra}}} y en la pestaña
\textbf{\emph{\texttt{Wooldrige}}} seleccione \texttt{hprice1}.

{\vspace{0pt} \color{gray!70!black}
\emph{o bien teclee en linea de comandos}:
\begin{verbatim}
open hprice1
\end{verbatim}
}

\item Los datos
\label{sec:org4ee2144}

Ésta es una aplicación con datos reales de casas unifamiliares en EEUU:
\begin{itemize}
\item \textsf{price}  = precio de venta (en miles de \$).
\item \textsf{assess} = tasación de la inmobiliaria (en miles de \$).
\item \textsf{bdrms}  = número de dormitorios.
\item \textsf{lotsize} = tamaño de la parcela en pies al cuadrado.
\item \textsf{sqrft}  = tamaño de la vivienda en pies al cuadrado.
\item \textsf{colonial} = 1 si es de estilo colonial. 0 en el resto de casos.
\end{itemize}

\item El modelo inicial
\label{sec:orgddd968d}
Inicialmente intentaremos emplear todas las variables disponibles para
explicar los precios:
\begin{displaymath}
  \scriptstyle
  \Vect{\VA{price}}\ = \ \beta_1\VAindUno 
  \ +\ \beta_2\Vect{\VA{assess}}
  \ +\ \beta_3\Vect{\VA{bdrms}}
  \ +\ \beta_4\Vect{\VA{lotsize}}
  \ +\ \beta_5\Vect{\VA{sqrft}}
  \ +\ \beta_6\Vect{\VA{colonial}}
  \ +\ \Vect{\per}
\end{displaymath}
\end{enumerate}

\subsection{Actividad 1}
\label{sec:orgf7d87e7}
Piense si alguna de las variables disponibles debería salir del
modelo, por no ser relevante en la determinación del precio de la
vivienda.
\subsection{Actividad 2}
\label{sec:org40468cd}
Piense cuáles son los signos esperados de los parámetros del modelo.

\subsection{Actividad 3}
\label{sec:orgab38ba5}
Ajuste por MCO el modelo:
\begin{displaymath}
  \scriptstyle
  \Vect{price}\ = \
       \Estmc{\beta_1}\Vect{1}
  \ +\ \Estmc{\beta_2}\Vect{assess}
  \ +\ \Estmc{\beta_3}\Vect{bdrms}
  \ +\ \Estmc{\beta_4}\Vect{lotsize}
  \ +\ \Estmc{\beta_5}\Vect{sqrft}
  \ +\ \Estmc{\beta_6}\Vect{colonial}
  \ +\ \res
\end{displaymath}

{\vspace{0pt} \color{gray!70!black}
\begin{verbatim}
Modelo1     <- ols price 0 assess bdrms lotsize sqrft colonial
\end{verbatim}
}

\begin{itemize}
\item ¿Qué variables son significativas en este modelo?  ¿Coincide esto con su previsión?
\item A la luz de esta primera regresión. ¿Las inmobiliarias infravaloran o sobrevaloran los inmuebles?
\end{itemize}

\subsection{Actividad 4}
\label{sec:orgbf0a016}
¡Sorprendentemente parece que las características del inmueble no son
significativas para explicar el precio!

¿Es conjuntamente significativo este modelo para ``explicar'' los
precios? Observe el estadístico F.

\subsection{Actividad 5}
\label{sec:org5d09456}
Si hay una estrecha relación lineal entre regresores, es difícil
discriminar el papel particular de cada uno. Esta incertidumbre se
refleja en la varianza de los estimadores.

Consecuentemente algunas variables, en teoría importantes, pueden
resultar estadísticamente no significativas.

Las inmobiliarias emplean las características del inmueble para
arrojar una tasación. Así, es muy probable una estrecha relación entre
las características y la tasación.

\begin{itemize}
\item Observe los diagramas de dispersión de las variables de cada
\end{itemize}
casa con su tasación

\textbf{\emph{\texttt{Ver -{}-> Gráficos múltiples}}} y elija \texttt{assess} como variable del
eje \texttt{y}, y el resto como variables del eje \texttt{X}.
{\vspace{0pt} \color{gray!70!black}
\emph{o bien teclee en linea de comandos}:
\begin{verbatim}
Diagramas   <- scatters bdrms lotsize sqrft colonial ; assess --output="display"
\end{verbatim}
}

\subsection{Actividad 6}
\label{sec:org335d2b6}
Analice la correlación entre \texttt{assess} y el resto de regresores.
{\vspace{0pt} \color{gray!70!black}
\begin{verbatim}
corr assess bdrms lotsize sqrft colonial
\end{verbatim}
}

\subsection{Actividad 7}
\label{sec:orga7f87f7}

\begin{itemize}
\item La colinealidad se debe a que la muestra no contiene información
suficiente para estimar con una precisión satisfactoria todos los
parámetros.

\item Las soluciones directas a este problema consisten en

\begin{itemize}
\item añadir información (en este caso no podemos)
\item simplificar el modelo
\item También es posible eliminar información redundante mediante
regresiones auxiliares
\end{itemize}
\end{itemize}

Mejor que analizar relaciones lineales entre pares (correlaciones) es
estudiar si las características de la casa explican en un modelo
lineal la valoración de las inmobiliarias. 
\begin{itemize}
\item Ajuste por MCO el siguiente modelo
\begin{displaymath}
  \Vect{assess}\ = \
       \Estmc{\beta_1}\Vect{1} 
  \ +\ \Estmc{\beta_2}\Vect{bdrms}
  \ +\ \Estmc{\beta_3}\Vect{lotsize}
  \ +\ \Estmc{\beta_4}\Vect{sqrft}
  \ +\ \Estmc{\beta_5}\Vect{colonial}
  \ +\ \res
\end{displaymath}
\end{itemize}

{\vspace{0pt} \color{gray!70!black}
\begin{verbatim}
ModeloAux   <- ols assess 0 bdrms lotsize sqrft colonial
\end{verbatim}
}

\begin{itemize}
\item Observe el coeficiente de determinación para comprobar hasta que
punto las características de las vivienda en su conjunto
``explican'' la tasación de la inmobiliaria.

\item ¿Qué variables son más significativas para explicar la tasación?
\end{itemize}
