Practicas/PracticasGretl/Lecc12.org
** Actividad 8 - Eliminando información redundante

1) Las inmobiliarias suelen tener conocimiento del estado de
   conservación de la vivienda, su antigüedad, su situación,
   orientación, calidades, estética, etc. Todas estas características
   habrán sido tenidas en cuenta en las tasaciones, pero están
   mezcladas con las otras características explícitamente incluidas en
   el modelo. Ello explica que un 30% de la variabilidad de =assess=
   no es explicada por el resto de regresores, pero si el 70%
   restante.

2) Los errores de ajuste por MCO son ortogonales a los
   regresores. Así, los errores de la última regresión corresponden a
   todos esos factores que han intervenido en la tasación, pero que
   son ortogonales a los regresores del modelo.

3) En el modelo principal, omitiendo =assess= pero incluyendo como
   regresor los errores de esta última regresión, incorporamos
   información sobre la tasación que es ortogonal al resto de
   regresores

Guarde los residuos de la ultima regresión: En la ventana de la
regresión auxiliar, pinche en */~Guardar --> Residuos~/* y y ponga
como nombre =OtrosFactores=.

#+latex: {\vspace{0pt} \color{gray!70!black}
/o bien teclee en linea de comandos/:
  #+begin_src hansl
OtrosFactTasac = $uhat
  #+end_src  
#+latex: }
  
- Ajuste por MCO el modelo:
  \begin{displaymath}
    \scriptstyle
    \Vect{price}\ = \
         \Estmc{\beta_1}\Vect{1} 
    \ +\ \Estmc{\beta_2}\Vect{bdrms}
    \ +\ \Estmc{\beta_3}\Vect{lotsize}
    \ +\ \Estmc{\beta_4}\Vect{sqrft}
    \ +\ \Estmc{\beta_5}\Vect{colonial}
    \ +\ \Estmc{\beta_6}\Vect{OtrosFactores} \ +\ \res
  \end{displaymath}

#+latex: {\vspace{0pt} \color{gray!70!black}
  #+begin_src hansl
Modelo2     <- ols price 0 bdrms lotsize sqrft colonial OtrosFactTasac
  #+end_src  
#+latex: }
  

- ¿Hay indicios de multicolinealidad?

- Compare el ajuste de este modelo con el del modelo inicial.

- Omita las variables no significativas al 1% para obtener un modelo final.

#+latex: {\vspace{0pt} \color{gray!70!black}
  #+begin_src hansl
ModeloFinal <- omit --auto=0.01
  #+end_src  
#+latex: }
  
# +LATEX: \clearpage
#+latex: \vspace{10pt}
#+latex: \noindent
*Código completo de la práctica*
#+latex: \vspace{10pt}
\lstinputlisting{scripts/Houses3.inp}
#+LATEX: \clearpage


* Construcción de vivienda nueva
   :PROPERTIES:
   :header-args: :tangle ./pub/scripts/RamanathanEX5-1.inp
   :END:

| Guión: | {{{lugar(RamanathanEX5-1.inp)}}} |

Usando ~data4-3.gdt~ del libro de Ramanathan, con el nº de viviendas
iniciadas (en miles) en los EEUU (=housing=), población (=pop=), PIB
en miles de millones de dólares con base en el año 1982 (=gnp=) y tipo
de interés del crédito hipotecario (=intrate=):
#+latex: {\vspace{0pt} \color{gray!70!black}
  #+begin_src hansl
open data4-3.gdt
  #+end_src  
#+latex: }

- Estime el siguiente modelo ~ModeloA~ y añádalo a la tabla de modelos
  \begin{displaymath}
    housing_{n} = \alpha_1 + \alpha_2\cdot intrate_n +  \alpha_3 \cdot pop_n + otros\ factores_n
  \end{displaymath}
  #+latex: {\vspace{0pt} \color{gray!70!black}
  #+begin_src hansl
ModeloA <- ols housing 0 intrate pop
modeltab add
  #+end_src  
  #+latex: }


- Estime el siguiente modelo ~ModeloB~ y añádalo a la tabla de modelos
  \begin{displaymath}
    housing_{n} = \beta_1 + \beta_2\cdot intrate_n +  \beta_3 \cdot gnp_n + otros\ factores_n
  \end{displaymath}
  #+latex: {\vspace{0pt} \color{gray!70!black}
  #+begin_src hansl
ModeloB <- ols housing 0 intrate gnp
modeltab add
  #+end_src  
  #+latex: }
  
- Estime el siguiente modelo ~ModeloC~ y añádalo a la tabla de modelos
  \begin{displaymath}
    housing_{n} = \gamma_1 + \gamma_2\cdot intrate_n +  \gamma_3 \cdot pop_n +  \gamma_4 \cdot gnp_n + otros\ factores_n
  \end{displaymath}
  #+latex: {\vspace{0pt} \color{gray!70!black}
  #+begin_src hansl
ModeloC <- ols housing 0 intrate pop gnp
modeltab add
  #+end_src  
  #+latex: }

- Compare los resultados.
  #+latex: {\vspace{0pt} \color{gray!70!black}
  #+begin_src hansl
modeltab show
  #+end_src  
  #+latex: }

- Realice un contraste de colinealidad entre regresores (~vif~).
  #+latex: {\vspace{0pt} \color{gray!70!black}
  #+begin_src hansl
vif
  #+end_src  
  #+latex: }

- Contraste la significatividad conjunta de =gnp= y =pop en ~ModeloC~.
  #+latex: {\vspace{0pt} \color{gray!70!black}
  #+begin_src hansl
omit pop gnp
modeltab add
scalar estadF  = $test
scalar pvalorF = pvalue(F, 2, ModeloC.$df, estadF)
  #+end_src  
  #+latex: }

- Compare los 4 modelos y mire las correlaciones entre los tres regresores.
  #+latex: {\vspace{0pt} \color{gray!70!black}
  #+begin_src hansl
modeltab show
corr intrate pop gnp
  #+end_src  
  #+latex: }

# +LATEX: \clearpage
#+latex: \vspace{10pt}
#+latex: \noindent
*Código completo de la práctica*
#+latex: \vspace{10pt}
\lstinputlisting{scripts/RamanathanEX5-1.inp}
#+LATEX: \clearpage


* Construcción de vivienda nueva (transformación a datos per-cápita)
   :PROPERTIES:
   :header-args: :tangle ./pub/scripts/RamanathanEX5-1v2.inp
   :END:

| Guión: | {{{lugar(RamanathanEX5-1v2.inp)}}} |

Abra el conjunto de datos ~data4-3.gdt~ del libro de Ramanathan, con
el nº de viviendas iniciadas (en miles) en los EEUU (=housing=),
población (=pop=), PIB en miles de millones de dólares con base en el
año 1982 (=gnp=) y tipo de interés del crédito hipotecario
(=intrate=):
#+latex: {\vspace{0pt} \color{gray!70!black}
  #+begin_src hansl
open data4-3.gdt
  #+end_src  
#+latex: }

- Estime de nuevo el siguiente modelo (que por la práctica anterior sabemos que tiene multicolinealidad)
  \begin{displaymath}
    housing_{n} = \gamma_1 + \gamma_2\cdot intrate_n +  \gamma_3 \cdot pop_n +  \gamma_4 \cdot gnp_n + otros\ factores_n
  \end{displaymath}
  #+latex: {\vspace{0pt} \color{gray!70!black}
  #+begin_src hansl
ModeloMCol <- ols housing 0 intrate pop gnp
  #+end_src  
  #+latex: }
  
- Defina la construcción de viviendas per-cápita
  ( =housingPC = housing/pop= ) y la correspondiente producción
  per-cápita ( =gnpPC= ); y estime el siguiente modelo
  \begin{displaymath}
    housingPC_{n} = \beta_1 + \beta_2\cdot intrate_n +  \beta_3 \cdot gnpPC_n + otros\ factores_n
  \end{displaymath}
  #+latex: {\vspace{0pt} \color{gray!70!black}
  #+begin_src hansl
series housingPC = housing/pop
series gnpPC     = gnp/pop
ModeloPC <- ols housingPC 0 intrate gnpPC 
  #+end_src  
  #+latex: }

- Compare los resultados. Como estos dos modelos tienen distinto
  regresando, no es posible incorporar ambos a una misma tabla de
  modelos. Para compararlos abra las correspondientes ventanas de
  estimación.

- Mire las correlaciones entre los nuevos regresores y compárelas con las del antiguo modelo.
  #+latex: {\vspace{0pt} \color{gray!70!black}
  #+begin_src hansl
corr gnp   intrate
corr gnpPC intrate
  #+end_src  
  #+latex: }
  
- Realice un contraste de colinealidad ~vif~ entre regresores en ambos modelos.

  (/la función ~vif~ se debe ejecutar justo después de estimar cada modelo/).
  #+latex: {\vspace{0pt} \color{gray!70!black}
  #+begin_src hansl
ols housing   0 intrate gnp   pop
vif

ols housingPC 0 intrate gnpPC 
vif
  #+end_src  
  #+latex: }

#+LATEX: \clearpage
#+latex: \vspace{10pt}
#+latex: \noindent
*Código completo de la práctica*
#+latex: \vspace{10pt}
\lstinputlisting{scripts/RamanathanEX5-1v2.inp}
#+LATEX: \clearpage


