Practicas/PracticasGretl/pub/Lecc12.tex

\subsection{Actividad 8 - Eliminando información redundante}
\label{sec:org39c6f7b}

\begin{enumerate}
\item Las inmobiliarias suelen tener conocimiento del estado de
conservación de la vivienda, su antigüedad, su situación,
orientación, calidades, estética, etc. Todas estas características
habrán sido tenidas en cuenta en las tasaciones, pero están
mezcladas con las otras características explícitamente incluidas en
el modelo. Ello explica que un 30\% de la variabilidad de \texttt{assess}
no es explicada por el resto de regresores, pero si el 70\%
restante.

\item Los errores de ajuste por MCO son ortogonales a los
regresores. Así, los errores de la última regresión corresponden a
todos esos factores que han intervenido en la tasación, pero que
son ortogonales a los regresores del modelo.

\item En el modelo principal, omitiendo \texttt{assess} pero incluyendo como
regresor los errores de esta última regresión, incorporamos
información sobre la tasación que es ortogonal al resto de
regresores
\end{enumerate}

Guarde los residuos de la ultima regresión: En la ventana de la
regresión auxiliar, pinche en \textbf{\emph{\texttt{Guardar -{}-> Residuos}}} y y ponga
como nombre \texttt{OtrosFactores}.

{\vspace{0pt} \color{gray!70!black}
\emph{o bien teclee en linea de comandos}:
\begin{verbatim}
OtrosFactTasac = $uhat
\end{verbatim}
}

\begin{itemize}
\item Ajuste por MCO el modelo:
\begin{displaymath}
  \scriptstyle
  \Vect{price}\ = \
       \Estmc{\beta_1}\Vect{1} 
  \ +\ \Estmc{\beta_2}\Vect{bdrms}
  \ +\ \Estmc{\beta_3}\Vect{lotsize}
  \ +\ \Estmc{\beta_4}\Vect{sqrft}
  \ +\ \Estmc{\beta_5}\Vect{colonial}
  \ +\ \Estmc{\beta_6}\Vect{OtrosFactores} \ +\ \res
\end{displaymath}
\end{itemize}

{\vspace{0pt} \color{gray!70!black}
\begin{verbatim}
Modelo2     <- ols price 0 bdrms lotsize sqrft colonial OtrosFactTasac
\end{verbatim}
}


\begin{itemize}
\item ¿Hay indicios de multicolinealidad?

\item Compare el ajuste de este modelo con el del modelo inicial.

\item Omita las variables no significativas al 1\% para obtener un modelo final.
\end{itemize}

{\vspace{0pt} \color{gray!70!black}
\begin{verbatim}
ModeloFinal <- omit --auto=0.01
\end{verbatim}
}

\vspace{10pt}
\noindent
\textbf{Código completo de la práctica}
\vspace{10pt}
\lstinputlisting{scripts/Houses3.inp}
\clearpage


\section{Construcción de vivienda nueva}
\label{sec:org7f5aa1a}
\begin{center}
\begin{tabular}{ll}
Guión: & \href{https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/RamanathanEX5-1.inp}{RamanathanEX5-1.inp}\\
\end{tabular}
\end{center}

Usando \texttt{data4-3.gdt} del libro de Ramanathan, con el nº de viviendas
iniciadas (en miles) en los EEUU (\texttt{housing}), población (\texttt{pop}), PIB
en miles de millones de dólares con base en el año 1982 (\texttt{gnp}) y tipo
de interés del crédito hipotecario (\texttt{intrate}):
{\vspace{0pt} \color{gray!70!black}
\begin{verbatim}
open data4-3.gdt
\end{verbatim}
}

\begin{itemize}
\item Estime el siguiente modelo \texttt{ModeloA} y añádalo a la tabla de modelos
\begin{displaymath}
  housing_{n} = \alpha_1 + \alpha_2\cdot intrate_n +  \alpha_3 \cdot pop_n + otros\ factores_n
\end{displaymath}
{\vspace{0pt} \color{gray!70!black}
\begin{verbatim}
ModeloA <- ols housing 0 intrate pop
modeltab add
\end{verbatim}
}
\end{itemize}


\begin{itemize}
\item Estime el siguiente modelo \texttt{ModeloB} y añádalo a la tabla de modelos
\begin{displaymath}
  housing_{n} = \beta_1 + \beta_2\cdot intrate_n +  \beta_3 \cdot gnp_n + otros\ factores_n
\end{displaymath}
{\vspace{0pt} \color{gray!70!black}
\begin{verbatim}
ModeloB <- ols housing 0 intrate gnp
modeltab add
\end{verbatim}
}

\item Estime el siguiente modelo \texttt{ModeloC} y añádalo a la tabla de modelos
\begin{displaymath}
  housing_{n} = \gamma_1 + \gamma_2\cdot intrate_n +  \gamma_3 \cdot pop_n +  \gamma_4 \cdot gnp_n + otros\ factores_n
\end{displaymath}
{\vspace{0pt} \color{gray!70!black}
\begin{verbatim}
ModeloC <- ols housing 0 intrate pop gnp
modeltab add
\end{verbatim}
}

\item Compare los resultados.
{\vspace{0pt} \color{gray!70!black}
\begin{verbatim}
modeltab show
\end{verbatim}
}

\item Realice un contraste de colinealidad entre regresores (\texttt{vif}).
{\vspace{0pt} \color{gray!70!black}
\begin{verbatim}
vif
\end{verbatim}
}

\item Contraste la significatividad conjunta de \texttt{gnp} y =pop en \texttt{ModeloC}.
{\vspace{0pt} \color{gray!70!black}
\begin{verbatim}
omit pop gnp
modeltab add
scalar estadF  = $test
scalar pvalorF = pvalue(F, 2, ModeloC.$df, estadF)
\end{verbatim}
}

\item Compare los 4 modelos y mire las correlaciones entre los tres regresores.
{\vspace{0pt} \color{gray!70!black}
\begin{verbatim}
modeltab show
corr intrate pop gnp
\end{verbatim}
}
\end{itemize}

\vspace{10pt}
\noindent
\textbf{Código completo de la práctica}
\vspace{10pt}
\lstinputlisting{scripts/RamanathanEX5-1.inp}
\clearpage


\section{Construcción de vivienda nueva (transformación a datos per-cápita)}
\label{sec:org73c5a83}
\begin{center}
\begin{tabular}{ll}
Guión: & \href{https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/RamanathanEX5-1v2.inp}{RamanathanEX5-1v2.inp}\\
\end{tabular}
\end{center}

Abra el conjunto de datos \texttt{data4-3.gdt} del libro de Ramanathan, con
el nº de viviendas iniciadas (en miles) en los EEUU (\texttt{housing}),
población (\texttt{pop}), PIB en miles de millones de dólares con base en el
año 1982 (\texttt{gnp}) y tipo de interés del crédito hipotecario
(\texttt{intrate}):
{\vspace{0pt} \color{gray!70!black}
\begin{verbatim}
open data4-3.gdt
\end{verbatim}
}

\begin{itemize}
\item Estime de nuevo el siguiente modelo (que por la práctica anterior sabemos que tiene multicolinealidad)
\begin{displaymath}
  housing_{n} = \gamma_1 + \gamma_2\cdot intrate_n +  \gamma_3 \cdot pop_n +  \gamma_4 \cdot gnp_n + otros\ factores_n
\end{displaymath}
{\vspace{0pt} \color{gray!70!black}
\begin{verbatim}
ModeloMCol <- ols housing 0 intrate pop gnp
\end{verbatim}
}

\item Defina la construcción de viviendas per-cápita
( \texttt{housingPC = housing/pop} ) y la correspondiente producción
per-cápita ( \texttt{gnpPC} ); y estime el siguiente modelo
\begin{displaymath}
  housingPC_{n} = \beta_1 + \beta_2\cdot intrate_n +  \beta_3 \cdot gnpPC_n + otros\ factores_n
\end{displaymath}
{\vspace{0pt} \color{gray!70!black}
\begin{verbatim}
series housingPC = housing/pop
series gnpPC     = gnp/pop
ModeloPC <- ols housingPC 0 intrate gnpPC 
\end{verbatim}
}

\item Compare los resultados. Como estos dos modelos tienen distinto
regresando, no es posible incorporar ambos a una misma tabla de
modelos. Para compararlos abra las correspondientes ventanas de
estimación.

\item Mire las correlaciones entre los nuevos regresores y compárelas con las del antiguo modelo.
{\vspace{0pt} \color{gray!70!black}
\begin{verbatim}
corr gnp   intrate
corr gnpPC intrate
\end{verbatim}
}

\item Realice un contraste de colinealidad \texttt{vif} entre regresores en ambos modelos.

(\emph{la función \texttt{vif} se debe ejecutar justo después de estimar cada modelo}).
{\vspace{0pt} \color{gray!70!black}
\begin{verbatim}
ols housing   0 intrate gnp   pop
vif

ols housingPC 0 intrate gnpPC 
vif
\end{verbatim}
}
\end{itemize}

\clearpage
\vspace{10pt}
\noindent
\textbf{Código completo de la práctica}
\vspace{10pt}
\lstinputlisting{scripts/RamanathanEX5-1v2.inp}
\clearpage
