Practicas/PracticasGretl/Lecc12.org
* Gastos de mantenimiento de los automóviles
   :PROPERTIES:
   :header-args: :tangle ./pub/scripts/RamanathanEX5-2.inp
   :END:

| Guión: | {{{lugar(RamanathanEX5-2.inp)}}} |

(/La siguiente práctica reproduce el ejemplo 5.2 del libro de Ramanathan./)

Abra el conjunto de datos ~data3-7.gdt~, del libro de Ramanathan,
sobre costes de mantenimiento de coches Toyota (=cost=), así como la
edad de cada coche en semanas (=age=) y en número de millas recorridas
(=miles=).
#+latex: {\vspace{0pt} \color{gray!70!black}
#+begin_src hansl
open data3-7.gdt
#+end_src  
#+latex: }

- Mire las correlaciones entre los dos regresores.
  #+latex: {\vspace{0pt} \color{gray!70!black}
  #+begin_src hansl
corr age miles
  #+end_src  
  #+latex: }
  
- Estime el siguiente modelo ~ModeloA~ y añádalo a la tabla de
  modelos
  \begin{displaymath}
    cost_{n} = \alpha_1 + \alpha_2\cdot age_n +  otros\ factores_n
  \end{displaymath}
  #+latex: {\vspace{0pt} \color{gray!70!black}
  #+begin_src hansl
ModeloA <- ols cost 0 age
modeltab add
  #+end_src  
  #+latex: }

- Estime el siguiente modelo ~ModeloB~ y añádalo a la tabla de modelos
  \begin{displaymath}
    cost_{n} = \beta_1 +  \beta_2 \cdot miles_n + otros\ factores_n
  \end{displaymath}
  #+latex: {\vspace{0pt} \color{gray!70!black}
  #+begin_src hansl
ModeloB <- ols cost 0 miles
modeltab add
  #+end_src  
  #+latex: }

- Estime el siguiente modelo ~ModeloC~ y añádalo a la tabla de modelos
  \begin{displaymath}
    cost_{n} = \gamma_1 + \gamma_2\cdot age_n + \gamma_4 \cdot miles_n + otros\ factores_n
  \end{displaymath}
  #+latex: {\vspace{0pt} \color{gray!70!black}
  #+begin_src hansl
ModeloC <- ols cost 0 age miles
modeltab add
  #+end_src  
  #+latex: }

- Compare los resultados.

  Fíjese que aunque =age= y =miles= son siempre significativas, el
  efecto de los regresores cambia mucho en el último modelo respecto a
  los resultados de los dos primeros modelos y, de hecho, el signo
  para =miles= en el último modelo contradice al sentido común.
  #+latex: {\vspace{0pt} \color{gray!70!black}
  #+begin_src hansl
modeltab show
  #+end_src  
  #+latex: }

- Realice un contraste de colinealidad entre regresores. Dibuje un
  diagrama de dispersión entre =miles= y =age=, y mire la correlación
  entre ambas variables.
  #+latex: {\vspace{0pt} \color{gray!70!black}
  #+begin_src hansl
vif
scatters miles; age --output="display"
rho = corr(miles, age)
  #+end_src  
  #+latex: }

- Contraste la significatividad conjunta de =miles= y =age= en
  ~ModeloC~.
  #+latex: {\vspace{0pt} \color{gray!70!black}
  #+begin_src hansl
scalar estadF  = $Fstat
scalar pvalorF = pvalue(F, 2, ModeloC.$df, estadF)
  #+end_src  
  #+latex: }

- La serie de errores absolutos de predicción (APE) se calcula como
  \begin{displaymath}
    ape_n=100
    \begin{vmatrix}
      \frac{\resi{n}}{y_n}
    \end{vmatrix}
  \end{displaymath}
  Calcule la serie de errores absolutos de predicción de cada modelo.
  #+latex: {\vspace{0pt} \color{gray!70!black}
  #+begin_src hansl
# Error porcentual absoluto (ape)
series apeA = 100*abs(ModeloA.$uhat)/cost
series apeB = 100*abs(ModeloB.$uhat)/cost
series apeC = 100*abs(ModeloC.$uhat)/cost
  #+end_src  
  #+latex: }

- Calcule los errores absolutos de predicción medios (MAPE) de cada
  modelo. ¿Qué modelo predice mejor?
  
  Los errores absolutos medios de predicción (MAPE) son:
  + $mapeA =  227,75136$
  + $mapeB =  278,19832$
  + $mapeC =  48,240362$
  #+latex: {\vspace{0pt} \color{gray!70!black}
  #+begin_src hansl
# Error porcentual absoluto medio 
scalar mapeA = mean(apeA)
scalar mapeB = mean(apeB)
scalar mapeC = mean(apeC)
print mapeA mapeB mapeC
  #+end_src  
  #+latex: }

#+LATEX: \clearpage
#+latex: \vspace{10pt}
#+latex: \noindent
*Código completo de la práctica*
#+latex: \vspace{10pt}
\lstinputlisting{scripts/RamanathanEX5-2.inp}
#+LATEX: \clearpage


