Practicas/PracticasGretl/pub/Lecc12.tex


\section{Gastos de mantenimiento de los automóviles}
\label{sec:org97c5874}
\begin{center}
\begin{tabular}{ll}
Guión: & \href{https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/RamanathanEX5-2.inp}{RamanathanEX5-2.inp}\\
\end{tabular}
\end{center}

(\emph{La siguiente práctica reproduce el ejemplo 5.2 del libro de Ramanathan.})

Abra el conjunto de datos \texttt{data3-7.gdt}, del libro de Ramanathan,
sobre costes de mantenimiento de coches Toyota (\texttt{cost}), así como la
edad de cada coche en semanas (\texttt{age}) y en número de millas recorridas
(\texttt{miles}).
{\vspace{0pt} \color{gray!70!black}
\begin{verbatim}
open data3-7.gdt
\end{verbatim}
}

\begin{itemize}
\item Mire las correlaciones entre los dos regresores.
{\vspace{0pt} \color{gray!70!black}
\begin{verbatim}
corr age miles
\end{verbatim}
}

\item Estime el siguiente modelo \texttt{ModeloA} y añádalo a la tabla de
modelos
\begin{displaymath}
  cost_{n} = \alpha_1 + \alpha_2\cdot age_n +  otros\ factores_n
\end{displaymath}
{\vspace{0pt} \color{gray!70!black}
\begin{verbatim}
ModeloA <- ols cost 0 age
modeltab add
\end{verbatim}
}

\item Estime el siguiente modelo \texttt{ModeloB} y añádalo a la tabla de modelos
\begin{displaymath}
  cost_{n} = \beta_1 +  \beta_2 \cdot miles_n + otros\ factores_n
\end{displaymath}
{\vspace{0pt} \color{gray!70!black}
\begin{verbatim}
ModeloB <- ols cost 0 miles
modeltab add
\end{verbatim}
}

\item Estime el siguiente modelo \texttt{ModeloC} y añádalo a la tabla de modelos
\begin{displaymath}
  cost_{n} = \gamma_1 + \gamma_2\cdot age_n + \gamma_4 \cdot miles_n + otros\ factores_n
\end{displaymath}
{\vspace{0pt} \color{gray!70!black}
\begin{verbatim}
ModeloC <- ols cost 0 age miles
modeltab add
\end{verbatim}
}

\item Compare los resultados.

Fíjese que aunque \texttt{age} y \texttt{miles} son siempre significativas, el
efecto de los regresores cambia mucho en el último modelo respecto a
los resultados de los dos primeros modelos y, de hecho, el signo
para \texttt{miles} en el último modelo contradice al sentido común.
{\vspace{0pt} \color{gray!70!black}
\begin{verbatim}
modeltab show
\end{verbatim}
}

\item Realice un contraste de colinealidad entre regresores. Dibuje un
diagrama de dispersión entre \texttt{miles} y \texttt{age}, y mire la correlación
entre ambas variables.
{\vspace{0pt} \color{gray!70!black}
\begin{verbatim}
vif
scatters miles; age --output="display"
rho = corr(miles, age)
\end{verbatim}
}

\item Contraste la significatividad conjunta de \texttt{miles} y \texttt{age} en
\texttt{ModeloC}.
{\vspace{0pt} \color{gray!70!black}
\begin{verbatim}
scalar estadF  = $Fstat
scalar pvalorF = pvalue(F, 2, ModeloC.$df, estadF)
\end{verbatim}
}

\item La serie de errores absolutos de predicción (APE) se calcula como
\begin{displaymath}
  ape_n=100
  \begin{vmatrix}
    \frac{\resi{n}}{y_n}
  \end{vmatrix}
\end{displaymath}
Calcule la serie de errores absolutos de predicción de cada modelo.
{\vspace{0pt} \color{gray!70!black}
\begin{verbatim}
# Error porcentual absoluto (ape)
series apeA = 100*abs(ModeloA.$uhat)/cost
series apeB = 100*abs(ModeloB.$uhat)/cost
series apeC = 100*abs(ModeloC.$uhat)/cost
\end{verbatim}
}

\item Calcule los errores absolutos de predicción medios (MAPE) de cada
modelo. ¿Qué modelo predice mejor?

Los errores absolutos medios de predicción (MAPE) son:
\begin{itemize}
\item \(mapeA =  227,75136\)
\item \(mapeB =  278,19832\)
\item \(mapeC =  48,240362\)
\end{itemize}
{\vspace{0pt} \color{gray!70!black}
\begin{verbatim}
# Error porcentual absoluto medio 
scalar mapeA = mean(apeA)
scalar mapeB = mean(apeB)
scalar mapeC = mean(apeC)
print mapeA mapeB mapeC
\end{verbatim}
}
\end{itemize}

\clearpage
\vspace{10pt}
\noindent
\textbf{Código completo de la práctica}
\vspace{10pt}
\lstinputlisting{scripts/RamanathanEX5-2.inp}
\clearpage
