Practicas/PracticasGretl/Lecc12.org
* Gastos de mantenimiento de los automóviles (ortogonalización de regresores mediante regresiones auxiliares)
   :PROPERTIES:
   :header-args: :tangle ./pub/scripts/RamanathanEX5-2v2.inp
   :END:

| Guión: | {{{lugar(RamanathanEX5-2v2.inp)}}} |

Abra el conjunto de datos ~data3-7.gdt~, del libro de Ramanathan,
sobre costes de mantenimiento de coches Toyota (=cost=), así como la
edad de cada coche en semanas (=age=) y en número de millas recorridas
(=miles=).
#+latex: {\vspace{0pt} \color{gray!70!black}
#+begin_src hansl
open data3-7.gdt
#+end_src  
#+latex: }

- Estime el siguiente modelo ~ModeloA~
  \begin{displaymath}
    cost_{n} = \alpha_1 + \alpha_2\cdot age_n +  otros\ factores_n
  \end{displaymath}
  #+latex: {\vspace{0pt} \color{gray!70!black}
  #+begin_src hansl
ModeloA      <- ols cost 0 age
modeltab add
  #+end_src  
  #+latex: }

- Realice una regresión auxiliar de =miles= sobre una constante y
  =age=. Guarde los residuos con el nombre =uhatMiles=.
  #+latex: {\vspace{0pt} \color{gray!70!black}
  #+begin_src hansl
AuxRegA      <- ols miles const age
series uhatMiles = $uhat
  #+end_src  
  #+latex: }
  
  Piense qué interpretación tienen los residuos de esta regresión
  auxiliar.

  #+latex: {\color{gray!70!black} \small
  \texttt{uhatMiles} es la parte de las millas recorridas que no se
  puede aproximar por la edad del coche (algo así como un indicador de
  la intensidad de uso del coche).
  #+latex: }
  
- Verifique que no hay correlación entre los residuos de esta
  regresión auxiliar (=uhatMiles=) y =age=. ¿Por qué?
  #+latex: {\vspace{0pt} \color{gray!70!black}
  #+begin_src hansl
corr uhatMiles age
  #+end_src  
  #+latex: }

- Estime el siguiente modelo ~ModeloA_Raux~
  \begin{displaymath}
    cost_{n} = \alpha_1 + \alpha_2\cdot age_n +  \alpha_3\cdot uhatMiles_n + otros\ factores_n
  \end{displaymath}
  y compare los resultados con el ~ModeloA~. Realice un test de
  colinealidad para el modelo ~ModeloA_Raux~. ¿Hay indicios de
  colinealidad?
  #+latex: {\vspace{0pt} \color{gray!70!black}
  #+begin_src hansl
ModeloA_Raux <- ols cost 0 age uhatMiles
modeltab add
vif
  #+end_src  
  #+latex: }

- Estime el siguiente modelo ~ModeloB~
  \begin{displaymath}
    cost_{n} = \beta_1 +  \beta_2 \cdot miles_n + otros\ factores_n
  \end{displaymath}
  #+latex: {\vspace{0pt} \color{gray!70!black}
  #+begin_src hansl
ModeloB      <- ols cost 0 miles
modeltab add
  #+end_src  
  #+latex: }

- Realice una regresión auxiliar de =age= sobre una constante y
  =miles=. Guarde los residuos con el nombre =uhatAge=.
  #+latex: {\vspace{0pt} \color{gray!70!black}
  #+begin_src hansl
AuxRegB      <- ols age 0 miles
series uhatAge   = $uhat
  #+end_src  
  #+latex: }

- Estime el siguiente modelo ~ModeloB_Raux~
  \begin{displaymath}
    cost_{n} = \beta_1 +  \beta_2 \cdot miles_n + \beta_3 \cdot uhatAge_n + otros\ factores_n 
  \end{displaymath}
  y compare los resultados con el ~ModeloB~. Realice un test de
  colinealidad para el modelo ~ModeloB_Raux~. ¿Hay indicios de
  colinealidad?
  #+latex: {\vspace{0pt} \color{gray!70!black}
  #+begin_src hansl
ModeloB_Raux <- ols cost 0 miles uhatAge
modeltab add
vif
  #+end_src  
  #+latex: }

- Piense qué interpretación tiene el regresor =uhatAge= en esta
  regresión.

  #+latex: {\color{gray!90!black} \small
  El regresor \texttt{uhatAge} reflejará la parte del coste de
  mantenimiento debido al mero paso del tiempo (pues ya hemos
  descontado el uso del coche). Es una medida por el deterioro de
  coche por el simple paso del tiempo.
  #+latex: }

- Estime el siguiente modelo ~ModeloC~ 
  \begin{displaymath}
    cost_{n} = \gamma_1 + \gamma_2\cdot age_n + \gamma_4 \cdot miles_n + otros\ factores_n
  \end{displaymath}
  #+latex: {\vspace{0pt} \color{gray!70!black}
  #+begin_src hansl
ModeloC      <- ols cost 0 age miles
modeltab add
  #+end_src  
  #+latex: }

- Compare los resultados de los cinco modelos.
  #+latex: {\vspace{0pt} \color{gray!70!black}
  #+begin_src hansl
modeltab show
  #+end_src  
  #+latex: }

- Piense qué signos serian los esperados para los coeficientes y
  decida qué modelo prefiere.
  
  #+latex: {\color{gray!90!black} \small
  En el cuarto modelo \texttt{ModeloB\_Raux} todos los regresores
  (incluido \texttt{uhatAge}) tiene una interpretación natural;
  además, en ese modelo los regresores son significativos y con los
  signos esperados.
        
  Nótese que como tanto el \texttt{ModeloC} como los dos con
  regresiones auxiliares emplean la misma información (las mismas
  variables), los tres tiene estadísticos de selección de modelos
  idénticos. El ajuste es igual de bueno en los tres casos, aunque la
  interpretación de los coeficientes estimados difiere.
  #+latex: }

#+LATEX: \clearpage
#+latex: \vspace{10pt}
#+latex: \noindent
*Código completo de la práctica*
#+latex: \vspace{10pt}
\lstinputlisting{scripts/RamanathanEX5-2v2.inp}
#+LATEX: \clearpage


