Practicas/PracticasGretl/pub/Lecc12.tex


\section{Gastos de mantenimiento de los automóviles (ortogonalización de regresores mediante regresiones auxiliares)}
\label{sec:org193f6d4}
\begin{center}
\begin{tabular}{ll}
Guión: & \href{https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/RamanathanEX5-2v2.inp}{RamanathanEX5-2v2.inp}\\
\end{tabular}
\end{center}

Abra el conjunto de datos \texttt{data3-7.gdt}, del libro de Ramanathan,
sobre costes de mantenimiento de coches Toyota (\texttt{cost}), así como la
edad de cada coche en semanas (\texttt{age}) y en número de millas recorridas
(\texttt{miles}).
{\vspace{0pt} \color{gray!70!black}
\begin{verbatim}
open data3-7.gdt
\end{verbatim}
}

\begin{itemize}
\item Estime el siguiente modelo \texttt{ModeloA}
\begin{displaymath}
  cost_{n} = \alpha_1 + \alpha_2\cdot age_n +  otros\ factores_n
\end{displaymath}
{\vspace{0pt} \color{gray!70!black}
\begin{verbatim}
ModeloA      <- ols cost 0 age
modeltab add
\end{verbatim}
}

\item Realice una regresión auxiliar de \texttt{miles} sobre una constante y
\texttt{age}. Guarde los residuos con el nombre \texttt{uhatMiles}.
{\vspace{0pt} \color{gray!70!black}
\begin{verbatim}
AuxRegA      <- ols miles const age
series uhatMiles = $uhat
\end{verbatim}
}

Piense qué interpretación tienen los residuos de esta regresión
auxiliar.

{\color{gray!70!black} \small
\texttt{uhatMiles} es la parte de las millas recorridas que no se
puede aproximar por la edad del coche (algo así como un indicador de
la intensidad de uso del coche).
}

\item Verifique que no hay correlación entre los residuos de esta
regresión auxiliar (\texttt{uhatMiles}) y \texttt{age}. ¿Por qué?
{\vspace{0pt} \color{gray!70!black}
\begin{verbatim}
corr uhatMiles age
\end{verbatim}
}

\item Estime el siguiente modelo \texttt{ModeloA\_Raux}
\begin{displaymath}
  cost_{n} = \alpha_1 + \alpha_2\cdot age_n +  \alpha_3\cdot uhatMiles_n + otros\ factores_n
\end{displaymath}
y compare los resultados con el \texttt{ModeloA}. Realice un test de
colinealidad para el modelo \texttt{ModeloA\_Raux}. ¿Hay indicios de
colinealidad?
{\vspace{0pt} \color{gray!70!black}
\begin{verbatim}
ModeloA_Raux <- ols cost 0 age uhatMiles
modeltab add
vif
\end{verbatim}
}

\item Estime el siguiente modelo \texttt{ModeloB}
\begin{displaymath}
  cost_{n} = \beta_1 +  \beta_2 \cdot miles_n + otros\ factores_n
\end{displaymath}
{\vspace{0pt} \color{gray!70!black}
\begin{verbatim}
ModeloB      <- ols cost 0 miles
modeltab add
\end{verbatim}
}

\item Realice una regresión auxiliar de \texttt{age} sobre una constante y
\texttt{miles}. Guarde los residuos con el nombre \texttt{uhatAge}.
{\vspace{0pt} \color{gray!70!black}
\begin{verbatim}
AuxRegB      <- ols age 0 miles
series uhatAge   = $uhat
\end{verbatim}
}

\item Estime el siguiente modelo \texttt{ModeloB\_Raux}
\begin{displaymath}
  cost_{n} = \beta_1 +  \beta_2 \cdot miles_n + \beta_3 \cdot uhatAge_n + otros\ factores_n 
\end{displaymath}
y compare los resultados con el \texttt{ModeloB}. Realice un test de
colinealidad para el modelo \texttt{ModeloB\_Raux}. ¿Hay indicios de
colinealidad?
{\vspace{0pt} \color{gray!70!black}
\begin{verbatim}
ModeloB_Raux <- ols cost 0 miles uhatAge
modeltab add
vif
\end{verbatim}
}

\item Piense qué interpretación tiene el regresor \texttt{uhatAge} en esta
regresión.

{\color{gray!90!black} \small
El regresor \texttt{uhatAge} reflejará la parte del coste de
mantenimiento debido al mero paso del tiempo (pues ya hemos
descontado el uso del coche). Es una medida por el deterioro de
coche por el simple paso del tiempo.
}

\item Estime el siguiente modelo \texttt{ModeloC} 
\begin{displaymath}
  cost_{n} = \gamma_1 + \gamma_2\cdot age_n + \gamma_4 \cdot miles_n + otros\ factores_n
\end{displaymath}
{\vspace{0pt} \color{gray!70!black}
\begin{verbatim}
ModeloC      <- ols cost 0 age miles
modeltab add
\end{verbatim}
}

\item Compare los resultados de los cinco modelos.
{\vspace{0pt} \color{gray!70!black}
\begin{verbatim}
modeltab show
\end{verbatim}
}

\item Piense qué signos serian los esperados para los coeficientes y
decida qué modelo prefiere.

{\color{gray!90!black} \small
En el cuarto modelo \texttt{ModeloB\_Raux} todos los regresores
(incluido \texttt{uhatAge}) tiene una interpretación natural;
además, en ese modelo los regresores son significativos y con los
signos esperados.

Nótese que como tanto el \texttt{ModeloC} como los dos con
regresiones auxiliares emplean la misma información (las mismas
variables), los tres tiene estadísticos de selección de modelos
idénticos. El ajuste es igual de bueno en los tres casos, aunque la
interpretación de los coeficientes estimados difiere.
}
\end{itemize}

\clearpage
\vspace{10pt}
\noindent
\textbf{Código completo de la práctica}
\vspace{10pt}
\lstinputlisting{scripts/RamanathanEX5-2v2.inp}
\clearpage
