Practicas/PracticasGretl/Lecc12.org
* Pobreza y sus determinantes (omisión de variables)
   :PROPERTIES:
   :header-args: :tangle ./pub/scripts/RamanathanAp5-4.inp
   :END:

| Guión: | {{{lugar(RamanathanAp5-4.inp)}}}        |

Abra el conjunto de datos ~data4-6.gdt~, del libro de Ramanathan,
sobre el porcentaje de familias con una renta por debajo del nivel de
pobreza (=povrate=) en los condados de California. Intentaremos
explicar dicho porcentaje con las siguientes variables: =urb= es el
porcentaje de población urbana; =famsize= es el número medio de
personas por hogar, =unemp= es la tasa de desempleo, =highschl= es el
porcentaje de población mayor de 25 que ha completado el ``high
school'', =college= es el porcentaje de la población mayor de 25 que
ha completado 4 o más años de ``college'', y =medinc= es la renta
media familiar.
#+latex: {\vspace{0pt} \color{gray!70!black}
#+begin_src hansl
open data4-6.gdt
#+end_src  
#+latex: }

- Observe la correlación entre las variables explicativas
  #+latex: {\vspace{0pt} \color{gray!70!black}
  #+begin_src hansl
corr urb famsize unemp highschl college medinc
  #+end_src  
  #+latex: }

- Estime el modelo ``ModeloA'' con todas las variables explicativas.
  #+latex: {\vspace{0pt} \color{gray!70!black}
  #+begin_src hansl
ModeloA <- ols povrate const urb famsize unemp highschl college medinc
  #+end_src  
  #+latex: }

- Observe los elevados /p/-valores de algunas variables. Observe
  también el inesperado signo para =college=\dots ¿quizá es debido a
  un problema de multicolinealidad?

- Omita la variable menos significativa del modelo (la de mayor
  /p/-valor). Observe que prácticamente no hay cambios en el
  resultado.
  #+latex: {\vspace{0pt} \color{gray!70!black}
  #+begin_src hansl
ModeloB <- omit unemp
  #+end_src  
  #+latex: }

- Omita la siguiente variable menos significativa. Observe que ahora
  todas las variables son significativas, pero se mantiene el signo
  equivocado para la variable ``college''.  Esto sugiere la
  posibilidad de multicolinealidad; realice el correspondiente
  contraste =vif=.
  #+latex: {\vspace{0pt} \color{gray!70!black}
  #+begin_src hansl
ModeloC <- omit urb
vif
  #+end_src  
  #+latex: }

- Aunque la variable de renta familiar media (=medinc=) es la más
  significativa, cabe esperar que su efecto pueda ser aproximadamente
  explicado por las variables =highschl= y =college=. Pruebe a excluir
  dicha variable y compruebe que ahora el signo de =college= es
  adecuado.
  #+latex: {\vspace{0pt} \color{gray!70!black}
  #+begin_src hansl
ModeloD <- omit medinc
  #+end_src  
  #+latex: }

- Realice una regresión auxiliar de =medinc= sobre =famsize=, =unemp=,
  =highschl= y =college= y compruebe que dichas variables explican
  casi el 85% de la varianza de =medinc=. Quizá una solución es omitir
  dicha variable desde el principio, para poder captar adecuadamente
  el efecto de las demás variables.
  #+latex: {\vspace{0pt} \color{gray!70!black}
  #+begin_src hansl
Aux     <- ols medinc 0 famsize unemp highschl college
  #+end_src  
  #+latex: }

- Estime un modelo con todas las variables explicativas excepto
  =medinc=, y siga un procedimiento de eliminación secuencial de
  variables no significativas. ¿Es satisfactorio el modelo final?
  #+latex: {\vspace{0pt} \color{gray!70!black}
  #+begin_src hansl
ols povrate const urb famsize unemp highschl college
Final   <- omit --auto
  #+end_src  
  #+latex: }


# +LATEX: \clearpage
#+latex: \vspace{10pt}
#+latex: \noindent
*Código completo de la práctica*
#+latex: \vspace{10pt}
\lstinputlisting{scripts/RamanathanAp5-4.inp}
#+LATEX: \clearpage






* /en Lec12.tex hay más prácticas ocultas al final/                :noexport:
* Cambio estructural en la participación de las mujeres en el mercado laboral :noexport:
   :PROPERTIES:
   :header-args: :tangle ./pub/scripts/RamanathanPS7-6.inp
   :END:
   
| Guión: | {{{lugar(RamanathanPS7-6.inp)}}}        |

(/La siguiente práctica reproduce la aplicación 7.6 del libro de
Ramanathan./)

*Posible cambio estructural en la participación de las mujeres en el
mercado laboral*. Abra el conjunto de datos ~data7-4.gdt~, del libro
de Ramanathan, con datos de 50 estados de EEUU sobre la participación
de las mujeres en el mercado laboral. Los 50 primeros son del año 1980
y los 50 últimos de 1990. La variable a explicar es =WLFP=, que es el
\HLa{porcentaje de participación} de mujeres mayores de 16 años en el
mercado laboral. =YF= es el salario mediano de las mujeres (en miles
de dólares); =YM= es el salario mediano de los hombres (en miles de
dólares); =EDUC= es el porcentaje, de entre las mujeres con 24 o más
años, con el título de bachillerato; =UE= es la tasa de desempleo;
=MR= es el porcentaje de mujeres mayores de 16 años que están casadas;
=DR= es el porcentaje de mujeres divorciadas; =URB= es el porcentaje
de población urbana; =WH= es e porcentaje de mujeres mayores de 16
años que son de raza blanca.

Por último, la variable ficticia =D90= vale 1 si el dato corresponde
al año 1990 y 0 en caso contrario.

#+latex: {\vspace{0pt} \color{gray!70!black}
#+begin_src hansl
open data7-4.gdt
#+end_src  
#+latex: }


# +LATEX: \clearpage
#+latex: \vspace{10pt}
#+latex: \noindent
*Código completo de la práctica*
#+latex: \vspace{10pt}
\lstinputlisting{scripts/RamanathanPS7-6}
#+LATEX: \clearpage
