Practicas/PracticasGretl/pub/Lecc12.tex


\section{Pobreza y sus determinantes (omisión de variables)}
\label{sec:org26d1b09}
\begin{center}
\begin{tabular}{ll}
Guión: & \href{https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/RamanathanAp5-4.inp}{RamanathanAp5-4.inp}\\
\end{tabular}
\end{center}

Abra el conjunto de datos \texttt{data4-6.gdt}, del libro de Ramanathan,
sobre el porcentaje de familias con una renta por debajo del nivel de
pobreza (\texttt{povrate}) en los condados de California. Intentaremos
explicar dicho porcentaje con las siguientes variables: \texttt{urb} es el
porcentaje de población urbana; \texttt{famsize} es el número medio de
personas por hogar, \texttt{unemp} es la tasa de desempleo, \texttt{highschl} es el
porcentaje de población mayor de 25 que ha completado el ``high
school'', \texttt{college} es el porcentaje de la población mayor de 25 que
ha completado 4 o más años de ``college'', y \texttt{medinc} es la renta
media familiar.
{\vspace{0pt} \color{gray!70!black}
\begin{verbatim}
open data4-6.gdt
\end{verbatim}
}

\begin{itemize}
\item Observe la correlación entre las variables explicativas
{\vspace{0pt} \color{gray!70!black}
\begin{verbatim}
corr urb famsize unemp highschl college medinc
\end{verbatim}
}

\item Estime el modelo ``ModeloA'' con todas las variables explicativas.
{\vspace{0pt} \color{gray!70!black}
\begin{verbatim}
ModeloA <- ols povrate const urb famsize unemp highschl college medinc
\end{verbatim}
}

\item Observe los elevados \emph{p}-valores de algunas variables. Observe
también el inesperado signo para \texttt{college}\dots{} ¿quizá es debido a
un problema de multicolinealidad?

\item Omita la variable menos significativa del modelo (la de mayor
\emph{p}-valor). Observe que prácticamente no hay cambios en el
resultado.
{\vspace{0pt} \color{gray!70!black}
\begin{verbatim}
ModeloB <- omit unemp
\end{verbatim}
}

\item Omita la siguiente variable menos significativa. Observe que ahora
todas las variables son significativas, pero se mantiene el signo
equivocado para la variable ``college''.  Esto sugiere la
posibilidad de multicolinealidad; realice el correspondiente
contraste \texttt{vif}.
{\vspace{0pt} \color{gray!70!black}
\begin{verbatim}
ModeloC <- omit urb
vif
\end{verbatim}
}

\item Aunque la variable de renta familiar media (\texttt{medinc}) es la más
significativa, cabe esperar que su efecto pueda ser aproximadamente
explicado por las variables \texttt{highschl} y \texttt{college}. Pruebe a excluir
dicha variable y compruebe que ahora el signo de \texttt{college} es
adecuado.
{\vspace{0pt} \color{gray!70!black}
\begin{verbatim}
ModeloD <- omit medinc
\end{verbatim}
}

\item Realice una regresión auxiliar de \texttt{medinc} sobre \texttt{famsize}, \texttt{unemp},
\texttt{highschl} y \texttt{college} y compruebe que dichas variables explican
casi el 85\% de la varianza de \texttt{medinc}. Quizá una solución es omitir
dicha variable desde el principio, para poder captar adecuadamente
el efecto de las demás variables.
{\vspace{0pt} \color{gray!70!black}
\begin{verbatim}
Aux     <- ols medinc 0 famsize unemp highschl college
\end{verbatim}
}

\item Estime un modelo con todas las variables explicativas excepto
\texttt{medinc}, y siga un procedimiento de eliminación secuencial de
variables no significativas. ¿Es satisfactorio el modelo final?
{\vspace{0pt} \color{gray!70!black}
\begin{verbatim}
ols povrate const urb famsize unemp highschl college
Final   <- omit --auto
\end{verbatim}
}
\end{itemize}


\vspace{10pt}
\noindent
\textbf{Código completo de la práctica}
\vspace{10pt}
\lstinputlisting{scripts/RamanathanAp5-4.inp}
\clearpage
\end{document}